# -*- coding: utf-8 -*-  # UTF-8 인코딩을 사용하여 소스 코드 작성

# 사용자로부터 테스트 케이스의 수를 입력받습니다.
num = int(input())

# 1부터 num까지 반복합니다.
for i in range(1, num + 1):
    # 사용자로부터 p, q, r, s, w를 공백으로 구분하여 입력받고 정수로 변환합니다.
    p, q, r, s, w = map(int, input().split())
    
    # a는 p(1리터당 비용)와 w(소비량)의 곱으로 계산된 총 비용입니다.
    a = p * w
    
    # w가 r(기본 제공되는 무료 리터 수) 이하일 경우, 비용 b는 q(기본 비용)입니다.
    if w <= r:
        b = q
    else:
        # w가 r을 초과할 경우, 초과된 리터 수에 대해 s(초과 비용)를 추가하여 계산합니다.
        b = q + (w - r) * s
        
    # a와 b 중에서 더 작은 값을 출력합니다. 형식은 "#i min(a, b)"입니다.
    print(f'#{i} {min(a, b)}')
